app/controllers/recipes_controller.rb

  def index
    @search_term = params[:search]
    @page = params[:page].to_i
    Recipe.reset
    @recipes = Recipe.all(@search_term, @page)
---
SELECT "recipes".* FROM "recipes"